app/controllers/guitar_controller.rb

INSERT INTO "guitar_accessories" ("created_at", "updated_at", "guitarPick", "guitar_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-11-02 01:47:19.937867"], ["updated_at", "2017-11-02 01:47:19.937867"], ["guitarPick", "Plastic"], ["guitar_id", 2]]
INSERT INTO "guitar_transactions" ("buyDate", "created_at", "updated_at", "guitar_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["buyDate", "2017-11-02"], ["created_at", "2017-11-02 01:47:19.848584"], ["updated_at", "2017-11-02 01:47:19.848584"], ["guitar_id", 2]]
INSERT INTO "guitars" ("brandName", "modelName", "typeName", "price", "created_at", "updated_at", "serial", "stringsNo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@newGuitar = Guitar.new(guitar_params)
		@guitar_accessory = GuitarAccessory.new
		if params[:typeName] == "Acoustic"
			@guitar_accessory.guitarPick = "Wooden"
		else
		   	@guitar_accessory.guitarPick = "Plastic"
		end
		@newGuitar.guitar_accessory = @guitar_accessory
		@guitar_transaction = GuitarTransaction.new
		@guitar_transaction.buyDate = Date.today
		@newGuitar.guitar_transaction = @guitar_transaction
        @newGuitar.save

SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "guitar_transactions" SET "sellDate" = $1, "updated_at" = $2 WHERE "guitar_transactions"."id" = $3  [["sellDate", "2017-11-02"], ["updated_at", "2017-11-02 04:17:45.476784"], ["id", 6]]
---
	def sellGuitar
		puts "Checking params inside sellGuitar ----- #{params.inspect}"
		guitar = Guitar.find(params[:id])
		@guitar_transaction = guitar.guitar_transaction
		@guitar_accessory = guitar.guitar_accessory
		@guitar_transaction.sellDate = Date.today
		@guitar_accessory.strapType = params[:strapType]
		@guitar_transaction.save

SELECT "guitars".* FROM "guitars" ORDER BY created_at DESC
---
	def show
		@guitars = Guitar.all.order("created_at DESC")